{
  "What is cloud computing?": "is the delivery of computing services like servers, storage, databases, networking, software, and analytics over the internet ('the cloud') to offer faster innovation and flexible resources.",
  "What are the three main cloud service models?": "Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS).",
  "What is the difference between public, private, and hybrid cloud?": "Public cloud is available to anyone over the internet, private cloud is used exclusively by one organization, and hybrid cloud combines both, allowing data and applications to move between them.",
  "What are the benefits of using cloud computing?": "Scalability, cost-efficiency, reliability, speed, security, and global accessibility.",
  "What is serverless computing?": "Serverless computing allows developers to build and run applications without managing infrastructure. The cloud provider handles provisioning and scaling.",
  "What is a virtual machine (VM) in the context of cloud computing?": "A virtual machine is a software-based emulation of a physical computer that runs an operating system and applications just like a physical machine.",
  "What is autoscaling in cloud environments?": "Autoscaling automatically adjusts the number of active servers or instances based on traffic or demand to optimize resource usage and cost.",
  "What is a cloud region and availability zone?": "A region is a geographic area containing one or more data centers, and an availability zone is an isolated location within a region designed for redundancy and fault tolerance.",
  "What are common cloud security concerns?": "Data breaches, misconfigured cloud storage, insecure APIs, account hijacking, and insider threats.",
  "What is the shared responsibility model in cloud security?": "In the shared responsibility model, the cloud provider is responsible for the security of the cloud (hardware, software, network), while the customer is responsible for security in the cloud (data, applications, access control).",
  "What is an IAM policy in AWS?": "An IAM policy is a JSON document that defines permissions to determine what actions are allowed or denied on AWS resources.",
  "What are the types of IAM policies in AWS?": "identity-based policies (attached to users, groups, or roles), resource-based policies (attached to resources like S3 buckets), and permissions boundaries (limit permissions of roles or users).",
  "What is the principle of least privilege in IAM?": "It means granting users only the permissions they need to perform their tasks, and nothing more, to improve security.",
  "What is the difference between 'Allow' and 'Deny' in an IAM policy?": "'Allow' grants access to a specific action or resource, while 'Deny' explicitly blocks it. Deny overrides Allow if both are present.",
  "What is a managed policy vs an inline policy?": "One is reusable across multiple IAM users, groups, or roles, while the other is embedded directly into a specific IAM identity and cannot be reused.",
  "What is AWS Lambda?": "This service lets you execute backend code automatically in response to events, without needing to manage servers or infrastructure.",
  "What is the purpose of Amazon S3?": "This service offers scalable object storage commonly used for data backups, static content delivery, and media hosting.",
  "What is Amazon EC2?": "This service provides configurable virtual computing environments, allowing users to launch and manage virtual servers on demand.",
  "What is Amazon RDS?": "This service simplifies the setup and maintenance of relational databases by handling provisioning, patching, backups, and scaling.",
  "What is Amazon VPC?": "This service gives you control over a virtual networking environment, including IP addressing, subnets, and routing rules.",
  "What is Amazon CloudFront?": "This global service caches and delivers content to users from nearby locations, reducing latency and improving load speeds.",
  "What is Amazon DynamoDB?": "This NoSQL database service supports key-value and document data models with single-digit millisecond performance at scale.",
  "What is Amazon SQS?": "This messaging service enables loosely coupled communication between components by letting them send and receive messages asynchronously.",
  "What is Amazon SNS?": "This messaging service supports pub/sub communication and can deliver notifications across multiple endpoints and protocols.",
  "What is Amazon CloudWatch?": "This monitoring tool collects logs, metrics, and events to help you gain visibility into application performance and resource usage.",
  "What is Amazon EBS?": "This storage service provides block-level data volumes that can be attached to virtual servers for persistent, high-performance storage.",
  "What is Amazon Route 53?": "This scalable DNS service manages domain name resolution, routing internet traffic based on health checks and routing policies.",
  "What is Amazon Elastic Beanstalk?": "This platform automates deployment and scaling for web apps by handling infrastructure tasks like provisioning and load balancing.",
  "What is Amazon CloudFormation?": "This infrastructure automation tool uses templates to define, provision, and manage AWS resources in a repeatable way.",
  "What is Amazon EKS?": "This service provides a secure and managed environment for running Kubernetes clusters without maintaining the control plane.",
  "What is a subsnet?": "a range of IP addresses in your VPC that allows you to segment your network for better organization and security. Subnets can be public (accessible from the internet) or private (not directly accessible from the internet)."
}
